


Network Working Group                                         W. Sun, Ed.
Internet-Draft                                                      SJTU
Intended status: Standards Track                            G. Zhang, Ed.
Expires: February 3, 2010                                           CATR
                                                       September 8, 2009


 Label Switched Path (LSP) Dynamic Provisioning Performance Metrics in
                       Generalized MPLS Networks
                    draft-ietf-ccamp-lsp-dppm-08.txt

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.  This document may contain material
   from IETF Documents or IETF Contributions published or made publicly
   available before November 10, 2008.  The person(s) controlling the
   copyright in some of this material may not have granted the IETF
   Trust the right to allow modifications of such material outside the
   IETF Standards Process.  Without obtaining an adequate license from
   the person(s) controlling the copyright in such materials, this
   document may not be modified outside the IETF Standards Process, and
   derivative works of it may not be created outside the IETF Standards
   Process, except to format it for publication as an RFC or to
   translate it into languages other than English.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on March 11, 2010.

Copyright Notice

   Copyright (c) 2009 IETF Trust and the persons identified as the
   document authors.  All rights reserved.



Sun & Zhang              Expires March 11, 2010                 [Page 1]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents in effect on the date of
   publication of this document (http://trustee.ietf.org/license-info).
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.














































Sun & Zhang              Expires March 11, 2010                 [Page 2]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


Abstract

   Generalized Multi-Protocol Label Switching (GMPLS) is one of the most
   promising candidate technologies for future data transmission
   network.  GMPLS has been developed to control and operate different
   kinds of network elements, such as conventional routers, switches,
   Dense Wavelength Division Multiplexing (DWDM) systems, Add- Drop
   Multiplexers (ADMs), photonic cross-connects (PXCs), optical cross-
   connects (OXCs), etc.  Dynamic provisioning ability of these
   physically diverse devices differs from each other drastically.  At
   the same time, the need for dynamically provisioned connections is
   increasing because optical networks are being deployed in metro
   areas.  As different applications have varied requirements in the
   provisioning performance of optical networks, it is imperative to
   define standardized metrics and procedures such that the performance
   of networks and application needs can be mapped to each other.

   This document provides a series of performance metrics to evaluate
   the dynamic LSP provisioning performance in GMPLS networks,
   specifically the dynamic LSP setup/release performance.  These
   metrics can depict the features of GMPLS networks in LSP dynamic
   provisioning.





























Sun & Zhang              Expires March 11, 2010                 [Page 3]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  7

   2.  Conventions Used in This Document  . . . . . . . . . . . . . .  8

   3.  Overview of Performance Metrics  . . . . . . . . . . . . . . .  9

   4.  A Singleton Definition for Single Uni-directional LSP
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 10
     4.1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . 10
     4.2.  Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 10
     4.3.  Metric Parameters  . . . . . . . . . . . . . . . . . . . . 10
     4.4.  Metric Units . . . . . . . . . . . . . . . . . . . . . . . 11
     4.5.  Definition . . . . . . . . . . . . . . . . . . . . . . . . 11
     4.6.  Discussion . . . . . . . . . . . . . . . . . . . . . . . . 11
     4.7.  Methodologies  . . . . . . . . . . . . . . . . . . . . . . 12

   5.  A Singleton Definition for multiple Uni-directional LSP
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 13
     5.1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . 13
     5.2.  Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 13
     5.3.  Metric Parameters  . . . . . . . . . . . . . . . . . . . . 13
     5.4.  Metric Units . . . . . . . . . . . . . . . . . . . . . . . 13
     5.5.  Definition . . . . . . . . . . . . . . . . . . . . . . . . 13
     5.6.  Discussion . . . . . . . . . . . . . . . . . . . . . . . . 14
     5.7.  Methodologies  . . . . . . . . . . . . . . . . . . . . . . 15

   6.  A Singleton Definition for Single Bi-directional  LSP
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 16
     6.1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . 16
     6.2.  Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 16
     6.3.  Metric Parameters  . . . . . . . . . . . . . . . . . . . . 17
     6.4.  Metric Units . . . . . . . . . . . . . . . . . . . . . . . 17
     6.5.  Definition . . . . . . . . . . . . . . . . . . . . . . . . 17
     6.6.  Discussion . . . . . . . . . . . . . . . . . . . . . . . . 17
     6.7.  Methodologies  . . . . . . . . . . . . . . . . . . . . . . 18

   7.  A Singleton Definition for multiple Bi-directional  LSPs
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 19
     7.1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . 19
     7.2.  Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 19
     7.3.  Metric Parameters  . . . . . . . . . . . . . . . . . . . . 19
     7.4.  Metric Units . . . . . . . . . . . . . . . . . . . . . . . 19
     7.5.  Definition . . . . . . . . . . . . . . . . . . . . . . . . 19
     7.6.  Discussion . . . . . . . . . . . . . . . . . . . . . . . . 20
     7.7.  Methodologies  . . . . . . . . . . . . . . . . . . . . . . 21




Sun & Zhang              Expires March 11, 2010                 [Page 4]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   8.  A Singleton Definition for LSP Graceful Release Delay  . . . . 22
     8.1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . 22
     8.2.  Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 22
     8.3.  Metric Parameters  . . . . . . . . . . . . . . . . . . . . 22
     8.4.  Metric Units . . . . . . . . . . . . . . . . . . . . . . . 22
     8.5.  Definition . . . . . . . . . . . . . . . . . . . . . . . . 22
     8.6.  Discussion . . . . . . . . . . . . . . . . . . . . . . . . 23
     8.7.  Methodologies  . . . . . . . . . . . . . . . . . . . . . . 24

   9.  A Definition for Samples of Single Uni-directional LSP
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 26
     9.1.  Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 26
     9.2.  Metric Parameters  . . . . . . . . . . . . . . . . . . . . 26
     9.3.  Metric Units . . . . . . . . . . . . . . . . . . . . . . . 26
     9.4.  Definition . . . . . . . . . . . . . . . . . . . . . . . . 26
     9.5.  Discussion . . . . . . . . . . . . . . . . . . . . . . . . 27
     9.6.  Methodologies  . . . . . . . . . . . . . . . . . . . . . . 27
     9.7.  Typical testing cases  . . . . . . . . . . . . . . . . . . 27
       9.7.1.  With no LSP in the Network . . . . . . . . . . . . . . 28
       9.7.2.  With a number of LSPs in the Network . . . . . . . . . 28

   10. A Definition for Samples of Multiple Uni-directional LSPs
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 29
     10.1. Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 29
     10.2. Metric Parameters  . . . . . . . . . . . . . . . . . . . . 29
     10.3. Metric Units . . . . . . . . . . . . . . . . . . . . . . . 29
     10.4. Definition . . . . . . . . . . . . . . . . . . . . . . . . 29
     10.5. Discussion . . . . . . . . . . . . . . . . . . . . . . . . 30
     10.6. Methodologies  . . . . . . . . . . . . . . . . . . . . . . 30
     10.7. Typical testing cases  . . . . . . . . . . . . . . . . . . 30
       10.7.1. With No LSP in the Network . . . . . . . . . . . . . . 31
       10.7.2. With a Number of LSPs in the Network . . . . . . . . . 31

   11. A Definition for Samples of Single Bi-directional  LSP
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 32
     11.1. Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 32
     11.2. Metric Parameters  . . . . . . . . . . . . . . . . . . . . 32
     11.3. Metric Units . . . . . . . . . . . . . . . . . . . . . . . 32
     11.4. Definition . . . . . . . . . . . . . . . . . . . . . . . . 32
     11.5. Discussion . . . . . . . . . . . . . . . . . . . . . . . . 33
     11.6. Methodologies  . . . . . . . . . . . . . . . . . . . . . . 33
     11.7. Typical testing cases  . . . . . . . . . . . . . . . . . . 34
       11.7.1. With No LSP in the Network . . . . . . . . . . . . . . 34
       11.7.2. With a Number of LSPs in the Network . . . . . . . . . 34

   12. A Definition for Samples of Multiple Bi-directional  LSPs
       Setup Delay  . . . . . . . . . . . . . . . . . . . . . . . . . 35
     12.1. Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 35



Sun & Zhang              Expires March 11, 2010                 [Page 5]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


     12.2. Metric Parameters  . . . . . . . . . . . . . . . . . . . . 35
     12.3. Metric Units . . . . . . . . . . . . . . . . . . . . . . . 35
     12.4. Definition . . . . . . . . . . . . . . . . . . . . . . . . 35
     12.5. Discussion . . . . . . . . . . . . . . . . . . . . . . . . 36
     12.6. Methodologies  . . . . . . . . . . . . . . . . . . . . . . 36
     12.7. Typical testing cases  . . . . . . . . . . . . . . . . . . 36
       12.7.1. With No LSP in the Network . . . . . . . . . . . . . . 37
       12.7.2. With a Number of LSPs in the Network . . . . . . . . . 37

   13. A Definition for Samples of LSP Graceful Release Delay . . . . 38
     13.1. Metric Name  . . . . . . . . . . . . . . . . . . . . . . . 38
     13.2. Metric Parameters  . . . . . . . . . . . . . . . . . . . . 38
     13.3. Metric Units . . . . . . . . . . . . . . . . . . . . . . . 38
     13.4. Definition . . . . . . . . . . . . . . . . . . . . . . . . 38
     13.5. Discussion . . . . . . . . . . . . . . . . . . . . . . . . 38
     13.6. Methodologies  . . . . . . . . . . . . . . . . . . . . . . 39

   14. Some Statistics Definitions for Metrics to Report  . . . . . . 40
     14.1. The Minimum of Metric  . . . . . . . . . . . . . . . . . . 40
     14.2. The Median of Metric . . . . . . . . . . . . . . . . . . . 40
     14.3. The percentile of Metric . . . . . . . . . . . . . . . . . 40
     14.4. Failure statistics of Metric . . . . . . . . . . . . . . . 40
       14.4.1. Failure Count  . . . . . . . . . . . . . . . . . . . . 41
       14.4.2. Failure Ratio  . . . . . . . . . . . . . . . . . . . . 41

   15. Discussion . . . . . . . . . . . . . . . . . . . . . . . . . . 42

   16. Security Considerations  . . . . . . . . . . . . . . . . . . . 43

   17. IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 44

   18. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 45

   19. References . . . . . . . . . . . . . . . . . . . . . . . . . . 46
     19.1. Normative References . . . . . . . . . . . . . . . . . . . 46
     19.2. Informative References . . . . . . . . . . . . . . . . . . 46

   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 48













Sun & Zhang              Expires March 11, 2010                 [Page 6]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


1.  Introduction

   Generalized Multi-Protocol Label Switching (GMPLS) is one of the most
   promising control plane solutions for future transport and service
   network.  GMPLS has been developed to control and operate different
   kinds of network elements, such as conventional routers, switches,
   Dense Wavelength Division Multiplexing (DWDM) systems, Add-Drop
   Multiplexors (ADMs), photonic cross-connects (PXCs), optical cross-
   connects (OXCs), etc.  Dynamic provisioning ability of these
   physically diverse devices differs from each other drastically.

   The introduction of a control plane into optical circuit switching
   networks provides the basis for automating the provisioning of
   connections and drastically reduces connection provision delay.  As
   more and more services and applications are seeking to use GMPLS
   controlled networks as their underlying transport network, and
   increasingly in a dynamic way, the need is growing for measuring and
   characterizing the performance of LSP provisioning in GMPLS networks,
   such that requirement from applications and the provisioning
   capability of the network can be mapped to each other.

   This draft defines performance metrics and methodologies that can be
   used to depict the dynamic LSP provisioning performance of GMPLS
   networks, more specifically, performance of the signaling protocol.
   The metrics defined in this document can be used to depict the
   average performance of GMPLS implementations.

























Sun & Zhang              Expires March 11, 2010                 [Page 7]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


2.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].














































Sun & Zhang              Expires March 11, 2010                 [Page 8]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


3.  Overview of Performance Metrics

   In this memo, to depict the dynamic LSP provisioning performance of a
   GMPLS network, we define 3 performance metrics: uni-directional LSP
   setup delay, bi-directional LSP setup delay, and LSP graceful release
   delay.  The latency of the LSP setup/release signal is conceptually
   similar to the Round-trip Delay in IP networks.  This enables us to
   refer to the structures and notions introduced and discussed in the
   IPPM Framework document, [RFC2330] [RFC2679] [RFC2681].  The reader
   is assumed to be familiar with the notions in those documents.

   Note that data path related metrics, for example, the time between
   the reception of RESV message by ingress node and forward data path
   becomes operational, are defined in another document
   [I-D.sun-ccamp-dpm].  An implementation MAY choose whether to
   implement metrics in the two documents together.  However, it is
   RECOMMENDED that both measurements are performed to complement each
   other.

































Sun & Zhang              Expires March 11, 2010                 [Page 9]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


4.  A Singleton Definition for Single Uni-directional LSP Setup Delay

   This part defines a metric for single uni-directional Label Switched
   Path setup delay across a GMPLS network.

4.1.  Motivation

   Single uni-directional Label Switched Path setup delay is useful for
   several reasons:

   o  Single LSP setup delay is an important metric that depicts the
      provisioning performance of a GMPLS network.  Longer LSP setup
      delay will most likely incur higher overhead for the requesting
      application, especially when the LSP duration itself is comparable
      to the LSP setup delay.

   o  The minimum value of this metric provides an indication of the
      delay that will likely be experienced when the LSP traversed the
      shortest route at the lightest load in the control plane.  As the
      delay itself consists of several components, such as link
      propagation delay and nodal processing delay, this metric also
      reflects the status of control plane.  For example, for LSPs
      traversing the same route, longer setup delays may suggest
      congestion in the control channel or high control element load.
      For this reason, this metric is useful for testing and diagnostic
      purposes.

   o  The observed variance in a sample of LSP setup delay metric values
      variance may serve as an early indicator on the feasibility of
      support of applications that have stringent setup delay
      requirements.

   The measurement of single uni-directional LSP setup delay instead of
   bi-directional LSP setup delay is motivated by the following factors:

   o  Some applications may use only uni-directional LSPs rather than
      bi-directional ones.  For example, content delivery services with
      multicasting may use only uni-directional LSPs.

4.2.  Metric Name

   single uni-directional LSP setup delay

4.3.  Metric Parameters

   o  ID0, the ingress LSR ID





Sun & Zhang              Expires March 11, 2010                [Page 10]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  ID1, the egress LSR ID

   o  T, a time when the setup is attempted

4.4.  Metric Units

   The value of single uni-directional LSP setup delay is either a real
   number, or an undefined number of milliseconds.

4.5.  Definition

   The single uni-directional LSP setup delay from ingress node ID0 to
   egress node ID1 [RFC3945] at T is dT means that ingress node ID0
   sends the first bit of a PATH message packet to egress node ID1 at
   wire-time T, and that ingress node ID0 received the last bit of
   responding RESV message packet from egress node ID1 at wire-time
   T+dT.

   The single uni-directional LSP setup delay from ingress node ID0 to
   egress node ID1 at T is undefined, means that ingress node ID0 sends
   the first bit of PATH message packet to egress node ID1 at wire-time
   T and that ingress node ID0 does not receive the corresponding RESV
   message within a reasonable period of time.

   The undefined value of this metric indicates an event of Single Uni-
   directional LSP Setup Failure, and would be used to report a count or
   an percentage of Single Uni-directional LSP Setup failures.  See
   section Section 14.4 for definitions of LSP setup/release failures.

4.6.  Discussion

   The following issues are likely to come up in practice:

   o  The accuracy of uni-directional LSP setup delay at time T depends
      on the clock resolution in the ingress node; but synchronization
      between the ingress node and egress node is not required since
      uni-directional LSP setup uses two-way signaling.

   o  A given methodology will have to include a way to determine
      whether a latency value is infinite or whether it is merely very
      large.  Simple upper bounds MAY be used.  But GMPLS networks may
      accommodate many kinds of devices.  For example, some photonic
      cross-connects (PXCs) have to move micro mirrors.  This physical
      motion may take several milliseconds.  But the common electronic
      switches can finish the nodal processing within several
      microseconds.  So the uni-directional LSP setup delay varies
      drastically from one network to another.  In practice, the upper
      bound should be chosen carefully and the value MUST be reported.



Sun & Zhang              Expires March 11, 2010                [Page 11]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  If ingress node sends out the PATH message to set up an LSP, but
      never receives the corresponding RESV message, the uni-directional
      LSP setup delay MUST be set to undefined.

   o  If the ingress node sends out the PATH message to set up an LSP
      but receives a PathErr message, the uni-directional LSP setup
      delay MUST be set to undefined.  There are many possible reasons
      for this case.  For example, the PATH message has invalid
      parameters or the network does not have enough resource to set up
      the requested LSP, etc.

4.7.  Methodologies

   Generally the methodology would proceed as follows:

   o  Make sure that the network has enough resource to set up the
      requested LSP.

   o  At the ingress node, form the PATH message according to the LSP
      requirements.  A timestamp (T1) may be stored locally on the
      ingress node when the PATH message packet is sent towards the
      egress node.

   o  If the corresponding RESV message arrives within a reasonable
      period of time, take the timestamp (T2) as soon as possible upon
      receipt of the message.  By subtracting the two timestamps, an
      estimate of uni-directional LSP setup delay (T2 -T1) can be
      computed.

   o  If the corresponding RESV message fails to arrive within a
      reasonable period of time, the uni-directional LSP setup delay is
      deemed to be undefined.  Note that the 'reasonable' threshold is a
      parameter of the methodology.

   o  If the corresponding response message is PathErr, the uni-
      directional LSP setup delay is deemed to be undefined.















Sun & Zhang              Expires March 11, 2010                [Page 12]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


5.  A Singleton Definition for multiple Uni-directional LSP Setup Delay

   This part defines a metric for multiple uni-directional Label
   Switched Paths setup delay across a GMPLS network.

5.1.  Motivation

   Multiple uni-directional Label Switched Paths setup delay is useful
   for several reasons:

   o  Carriers may require a large number of LSPs be set up during a
      short time period.  This request may arise e.g. as a consequence
      to interruptions on established LSPs or other network failures.

   o  The time needed to setup a large number of LSPs during a short
      time period can not be deduced from single LSP setup delay.

5.2.  Metric Name

   Multiple uni-directional LSPs setup delay

5.3.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  Lambda_m, a rate in reciprocal milliseconds

   o  X, the number of LSPs to setup

   o  T, a time when the first setup is attempted

5.4.  Metric Units

   The value of multiple uni-directional LSPs setup delay is either a
   real number, or an undefined number of milliseconds.

5.5.  Definition

   Given Lambda_m and X, the multiple uni-directional LSPs setup delay
   from the ingress node to the egress node [RFC3945] at T is dT means:

   o  ingress node ID0 sends the first bit of the first PATH message
      packet to egress node ID1 at wire-time T

   o  all subsequent (X-1) PATH messages are sent according to the
      specified Poisson process with arrival rate Lambda_m



Sun & Zhang              Expires March 11, 2010                [Page 13]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  ingress node ID0 receives all corresponding RESV message packets
      from egress node ID1, and

   o  ingress node ID0 receives the last RESV message packet at wire-
      time T+dT

   The multiple uni-directional LSPs setup delay at T is undefined,
   means that ingress node ID0 sends all the PATH messages toward egress
   node ID1 and the first bit of the first PATH message packet is sent
   at wire-time T and that ingress node ID0 does not receive one or more
   of the corresponding RESV messages within a reasonable period of
   time.

   The undefined value of this metric indicates an event of Multiple
   Uni-directional LSP Setup Failure, and would be used to report a
   count or an percentage of Multiple Uni-directional LSP Setup
   failures.  See section Section 14.4 for definitions of LSP setup/
   release failures.

5.6.  Discussion

   The following issues are likely to come up in practice:

   o  The accuracy of multiple uni-directional LSPs setup delay at time
      T depends on the clock resolution in the ingress node; but
      synchronization between the ingress node and egress node is not
      required since uni-directional LSP setup uses two-way signaling.

   o  A given methodology will have to include a way to determine
      whether a latency value is infinite or whether it is merely very
      large.  Simple upper bounds MAY be used.  But GMPLS networks may
      accommodate many kinds of devices.  For example, some photonic
      cross-connects (PXCs) have to move micro mirrors.  This physical
      motion may take several milliseconds.  But electronic switches can
      finish the nodal processing within several microseconds.  So the
      multiple uni-directional LSP setup delay varies drastically from
      one network to another.  In practice, the upper bound should be
      chosen carefully and the value MUST be reported.

   o  If ingress node sends out the multiple PATH messages to set up the
      LSPs, but never receives one or more of the corresponding RESV
      messages, multiple uni-directional LSP setup delay MUST be set to
      undefined.

   o  If ingress node sends out the PATH messages to set up the LSPs but
      receives one or more PathErr messages, multiple uni-directional
      LSPs setup delay MUST be set to undefined.  There are many
      possible reasons for this case.  For example, one of the PATH



Sun & Zhang              Expires March 11, 2010                [Page 14]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


      messages has invalid parameters or the network has not enough
      resource to set up the requested LSPs, etc.

   o  The arrival rate of the Poisson process Lambda_m should be chosen
      carefully such that in the one hand the control plane is not
      overburdened.  On the other hand, the arrival rate is large enough
      to meet the requirements of applications or services.

5.7.  Methodologies

   Generally the methodology would proceed as follows:

   o  Make sure that the network has enough resource to set up the
      requested LSPs.

   o  At the ingress node, form the PATH messages according to the LSPs'
      requirements.

   o  At the ingress node, select the time for each of the PATH messages
      according to the specified Poisson process.

   o  At the ingress node, send out the PATH messages according to the
      selected time.

   o  Store a timestamp (T1) locally on the ingress node when the first
      PATH message packet is sent towards the egress node.

   o  If all of the corresponding RESV messages arrive within a
      reasonable period of time, take the final timestamp (T2) as soon
      as possible upon the receipt of all the messages.  By subtracting
      the two timestamps, an estimate of multiple uni-directional LSPs
      setup delay (T2 -T1) can be computed.

   o  If one or more of the corresponding RESV messages fail to arrive
      within a reasonable period of time, the multiple uni-directional
      LSPs setup delay is deemed to be undefined.  Note that the
      'reasonable' threshold is a parameter of the methodology.

   o  If one or more of the corresponding response messages are PathErr,
      the multiple uni-directional LSPs setup delay is deemed to be
      undefined.










Sun & Zhang              Expires March 11, 2010                [Page 15]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


6.  A Singleton Definition for Single Bi-directional  LSP Setup Delay

   GMPLS allows establishment of bi-directional symmetric LSPs (not of
   asymmetric LSPs).  This part defines a metric for single bi-
   directional LSP setup delay across a GMPLS network.

6.1.  Motivation

   Single bi-directional Label Switched Path setup delay is useful for
   several reasons:

   o  LSP setup delay is an important metric that depicts the
      provisioning performance of a GMPLS network.  Longer LSP setup
      delay will incur higher overhead for the requesting application,
      especially when the LSP duration is comparable to the LSP setup
      delay.  Thus, measuring the setup delay is important for
      application scheduling.

   o  The minimum value of this metric provides an indication of the
      delay that will likely be experienced when the LSP traversed the
      shortest route at the lightest load in the control plane.  As the
      delay itself consists of several components, such as link
      propagation delay and nodal processing delay, this metric also
      reflects the status of control plane.  For example, for LSPs
      traversing the same route, longer setup delays may suggest
      congestion in the control channel or high control element load.
      For this reason, this metric is useful for testing and diagnostic
      purposes.

   o  LSP setup delay variance has different impact on applications.
      Erratic variation in LSP setup delay makes it difficult to support
      applications that have stringent setup delay requirement.

   The measurement of single bi-directional LSP setup delay instead of
   uni-directional LSP setup delay is motivated by the following
   factors:

   o  Bi-directional LSPs are seen as a requirement for many GMPLS
      networks.  Its provisioning performance is important to
      applications that generate bi-directional traffic.

6.2.  Metric Name

   Single bi-directional LSP setup delay







Sun & Zhang              Expires March 11, 2010                [Page 16]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


6.3.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T, a time when the setup is attempted

6.4.  Metric Units

   The value of single bi-directional LSP setup delay is either a real
   number, or an undefined number of milliseconds.

6.5.  Definition

   For a real number dT, the single bi-directional LSP setup delay from
   ingress node ID0 to egress node ID1 at T is dT, means that ingress
   node ID0 sends out the first bit of a PATH message including an
   Upstream Label [RFC3473] heading for egress node ID1 at wire-time T,
   egress node ID1 receives that packet, then immediately sends a RESV
   message packet back to ingress node ID0, and that ingress node ID0
   receives the last bit of the RESV message packet at wire-time T+dT.

   The single bi-directional LSP setup delay from ingress node ID0 to
   egress node ID1 at T is undefined, means that ingress node ID0 sends
   the first bit of PATH message to egress node ID1 at wire-time T and
   that ingress node ID0 does not receive that response packet within a
   reasonable period of time.

   The undefined value of this metric indicates an event of Single Bi-
   directional LSP Setup Failure, and would be used to report a count or
   an percentage of Single Bi-directional LSP Setup failures.  See
   section Section 14.4 for definitions of LSP setup/release failures.

6.6.  Discussion

   The following issues are likely to come up in practice:

   o  The accuracy of single bi-directional LSP setup delay depends on
      the clock resolution in the ingress node; but synchronization
      between the ingress node and egress node is not required since
      single bi-directional LSP setup uses two-way signaling.

   o  A given methodology will have to include a way to determine
      whether a latency value is infinite or whether it is merely very
      large.  Simple upper bounds MAY be used.  But GMPLS networks may
      accommodate many kinds of devices.  For example, some photonic
      cross-connects (PXCs) have to move micro mirrors.  This physical



Sun & Zhang              Expires March 11, 2010                [Page 17]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


      motion may take several milliseconds.  But electronic switches can
      finish the nodal processing within several microseconds.  So the
      bi-directional LSP setup delay varies drastically from one network
      to another.  In the process of bi-directional LSP setup, if the
      downstream node overrides the label suggested by the upstream
      node, the setup delay may also increase.  Thus, in practice, the
      upper bound should be chosen carefully and the value MUST be
      reported.

   o  If the ingress node sends out the PATH message to set up the LSP,
      but never receives the corresponding RESV message, single bi-
      directional LSP setup delay MUST be set to undefined.

   o  If the ingress node sends out the PATH message to set up the LSP,
      but receives PathErr message, single bi-directional LSP setup
      delay MUST be set to undefined.  There are many possible reasons
      for this case.  For example, the PATH message has invalid
      parameters or the network has not enough resource to set up the
      requested LSP.

6.7.  Methodologies

   Generally the methodology would proceed as follows:

   o  Make sure that the network has enough resource to set up the
      requested LSP.

   o  At the ingress node, form the PATH message (including the Upstream
      Label or suggested label) according to the LSP requirements.  A
      timestamp (T1) may be stored locally on the ingress node when the
      PATH message packet is sent towards the egress node.

   o  If the corresponding RESV message arrives within a reasonable
      period of time, take the final timestamp (T2) as soon as possible
      upon the receipt of the message.  By subtracting the two
      timestamps, an estimate of bi-directional LSP setup delay (T2 -T1)
      can be computed.

   o  If the corresponding RESV message fails to arrive within a
      reasonable period of time, the single bi-directional LSP setup
      delay is deemed to be undefined.  Note that the 'reasonable'
      threshold is a parameter of the methodology.

   o  If the corresponding response message is PathErr, the single bi-
      directional LSP setup delay is deemed to be undefined.






Sun & Zhang              Expires March 11, 2010                [Page 18]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


7.  A Singleton Definition for multiple Bi-directional  LSPs Setup Delay

   This part defines a metric for multiple bi-directional LSPs setup
   delay across a GMPLS network.

7.1.  Motivation

   multiple bi-directional LSPs setup delay is useful for several
   reasons:

   o  Upon traffic interruption caused by network failure or network
      upgrade, carriers may require a large number of LSPs be set up
      during a short time period

   o  The time needed to setup a large number of LSPs during a short
      time period can not be deduced by single LSP setup delay

7.2.  Metric Name

   Multiple bi-directional LSPs setup delay

7.3.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  Lambda_m, a rate in reciprocal milliseconds

   o  X, the number of LSPs to setup

   o  T, a time when the first setup is attempted

7.4.  Metric Units

   The value of multiple bi-directional LSPs setup delay is either a
   real number, or an undefined number of milliseconds.

7.5.  Definition

   Given Lambda_m and X, for a real number dT, the multiple bi-
   directional LSPs setup delay from ingress node to egress node at T is
   dT, means that:

   o  ingress node ID0 sends the first bit of the first PATH message
      heading for egress node ID1 at wire-time T





Sun & Zhang              Expires March 11, 2010                [Page 19]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  all subsequent (X-1) PATH messages are sent according to the
      specified Poisson process with arrival rate Lambda_m

   o  ingress node ID1 receives all corresponding RESV message packets
      from egress node ID1, and

   o  ingress node ID0 receives the last RESV message packet at wire-
      time T+dT

   The multiple bi-directional LSPs setup delay from ingress node to
   egress node at T is undefined, means that ingress node sends all the
   PATH messages to egress node and that the ingress node fails to
   receive one or more of the response RESV messages within a reasonable
   period of time.

   The undefined value of this metric indicates an event of Multiple Bi-
   directional LSP Setup Failure, and would be used to report a count or
   an percentage of Multiple Bi-directional LSP Setup failures.  See
   section Section 14.4 for definitions of LSP setup/release failures.

7.6.  Discussion

   The following issues are likely to come up in practice:

   o  The accuracy of multiple bi-directional LSPs setup delay depends
      on the clock resolution in the ingress node; but synchronization
      between the ingress node and egress node is not required since bi-
      directional LSP setup uses two-way signaling.

   o  A given methodology will have to include a way to determine
      whether a latency value is infinite or whether it is merely very
      large.  Simple upper bounds MAY be used.  But GMPLS networks may
      accommodate many kinds of devices.  For example, some photonic
      cross-connects (PXCs) have to move micro mirrors.  This physical
      motion may take several milliseconds.  But electronic switches can
      finish the nodal process within several microseconds.  So the
      multiple bi-directional LSPs setup delay varies drastically from a
      network to another.  In the process of multiple bi-directional
      LSPs setup, if the downstream node overrides the label suggested
      by the upstream node, the setup delay may also increase.  Thus, in
      practice, the upper bound should be chosen carefully and the value
      MUST be reported.

   o  If the ingress node sends out the PATH messages to set up the
      LSPs, but never receives all the corresponding RESV messages, the
      multiple bi-directional LSPs setup delay MUST be set to undefined.





Sun & Zhang              Expires March 11, 2010                [Page 20]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  If the ingress node sends out the PATH messages to set up the
      LSPs, but receives one or more responding PathErr messages, the
      multiple bi-directional LSPs setup delay MUST be set to undefined.
      There are many possible reasons for this case.  For example, one
      or more of the PATH messages have invalid parameters or the
      network has not enough resource to set up the requested LSPs.

   o  The arrival rate of the Poisson process Lambda_m should be
      carefully chosen such that on the one hand the control plane is
      not overburdened.  On the other hand, the arrival rate is large
      enough to meet the requirements of applications or services.

7.7.  Methodologies

   Generally the methodology would proceed as follows:

   o  Make sure that the network has enough resource to set up the
      requested LSPs.

   o  At the ingress node, form the PATH messages (including the
      Upstream Label or suggested label) according to the LSPs'
      requirements.

   o  At the ingress node, select the time for each of the PATH messages
      according to the specified Poisson process.

   o  At the ingress node, send out the PATH messages according to the
      selected time.

   o  Store a timestamp (T1) locally in the ingress node when the first
      PATH message packet is sent towards the egress node.

   o  If all of the corresponding RESV messages arrive within a
      reasonable period of time, take the final timestamp (T2) as soon
      as possible upon the receipt of all the messages.  By subtracting
      the two timestamps, an estimate of multiple bi-directional LSPs
      setup delay (T2 -T1) can be computed.

   o  If one or more of the corresponding RESV messages fail to arrive
      within a reasonable period of time, the multiple bi-directional
      LSPs setup delay is deemed to be undefined.  Note that the
      'reasonable' threshold is a parameter of the methodology.

   o  If one or more of the corresponding response messages are PathErr,
      the multiple bi-directional LSPs setup delay is deemed to be
      undefined.





Sun & Zhang              Expires March 11, 2010                [Page 21]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


8.  A Singleton Definition for LSP Graceful Release Delay

   There are two different kinds of LSP release mechanisms in GMPLS
   networks: graceful release and forceful release.  This document does
   not take forceful LSP release procedure into account.

8.1.  Motivation

   LSP graceful release delay is useful for several reasons:

   o  The LSP graceful release delay is part of the total cost of
      dynamic LSP provisioning.  For some short duration applications,
      the LSP release time can not be ignored

   o  The LSP graceful release procedure is more preferred in a GMPLS
      controlled network, particularly the optical networks.  Since it
      doesn't trigger restoration/protection, it is "alarm-free
      connection deletion" in [RFC4208].

8.2.  Metric Name

   LSP graceful release delay

8.3.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T, a time when the release is attempted

8.4.  Metric Units

   The value of LSP graceful release delay is either a real number, or
   an undefined number of milliseconds.

8.5.  Definition

   There are two different LSP graceful release procedures, one is
   initiated by the ingress node, and another is initiated by the egress
   node.  The two procedures are depicted in [RFC3473].  We define the
   graceful LSP release delay for these two procedures separately.

   For a real number dT, the LSP graceful release delay from ingress
   node ID0 to egress node ID1 at T is dT, means that ingress node ID0
   sends the first bit of a PATH message including Admin Status Object
   with the Reflect (R) and Delete (D) bits set to the egress node at
   wire-time T, that egress node ID1 receives that packet, then



Sun & Zhang              Expires March 11, 2010                [Page 22]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   immediately sends a RESV message including Admin Status Object with
   the Delete (D) bit set back to the ingress node.  Ingress node ID0
   sends out PathTear downstream to remove the LSP, and egress node ID1
   receives the last bit of PathTear packet at wire-time T+dT.

   Also as an option, upon receipt of the PATH message including Admin
   Status Object with the Reflect (R) and Delete (D) bits set, egress
   node ID1 may respond with PathErr message with the Path_State_Removed
   flag set.

   The LSP graceful release delay from ingress node ID0 to egress node
   ID1 at T is undefined, means that ingress node ID0 sends the first
   bit of PATH message to egress node ID1 at wire-time T and that
   (either egress node does not receive the PATH packet, egress node
   does not send corresponding RESV message packet in response, or
   ingress node does not receive that RESV packet, and) egress node ID1
   does not receive the PathTear within a reasonable period of time.

   The LSP graceful release delay from egress node ID1 to ingress node
   ID0 at T is dT, means that egress node ID1 sends the first bit of a
   RESV message including Admin Status Object with setting the Reflect
   (R) and Delete (D) bits to ingress node at wire-time T. Ingress node
   ID0 sends out PathTear downstream to remove the LSP, and egress node
   ID1 receives the last bit of PathTear packet at wire-time T+dT.

   The LSP graceful release delay from egress node ID1 to ingress node
   ID0 at T is undefined, means that egress node ID1 sends the first bit
   of RESV message including Admin Status Object with setting the
   Reflect (R) and Delete (D) bits to ingress node ID0 at wire-time T
   and that (either ingress node does not receive the RESV packet, or
   ingress node does not send PathTear message packet in response, and)
   egress node ID1 does not receive the PathTear within a reasonable
   period of time.

   The undefined value of this metric indicates an event of LSP Graceful
   Release Failure, and would be used to report a count or an percentage
   of LSP Graceful Release failures.  See section Section 14.4 for
   definitions of LSP setup/release failures.

8.6.  Discussion

   The following issues are likely to come up in practice:

   o  In the first (second) circumstance, the accuracy of LSP graceful
      release delay at time T depends on the clock resolution in the
      ingress (egress) node.  In the first circumstance, synchronization
      between the ingress node and egress node is required; but not in
      the second circumstance;



Sun & Zhang              Expires March 11, 2010                [Page 23]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  A given methodology has to include a way to determine whether a
      latency value is infinite or whether it is merely very large.
      Simple upper bounds MAY be used.  But the upper bound should be
      chosen carefully in practice and the value MUST be reported;

   o  In the first circumstance, if the ingress node sends out PATH
      message including Admin Status Object with the Reflect (R) and
      Delete (D) bits set to initiate LSP graceful release, but the
      egress node never receives the corresponding PathTear message, LSP
      graceful release delay MUST be set to undefined.

   o  In the second circumstance, if the egress node sends out the RESV
      message including Admin Status Object with the Reflect (R) and
      Delete (D) bits set to initiate LSP graceful release, but never
      receives the corresponding PathTear message, LSP graceful release
      delay MUST be set to undefined.

8.7.  Methodologies

   In the first circumstance, the methodology may proceed as follows:

   o  Make sure the LSP to be deleted is set up;

   o  At the ingress node, form the PATH message including Admin Status
      Object with the Reflect (R) and Delete (D) bits set.  A timestamp
      (T1) may be stored locally on the ingress node when the PATH
      message packet is sent towards the egress node;

   o  Upon receiving the PATH message including Admin Status Object with
      the Reflect (R) and Delete (D) bits set, the egress node sends a
      RESV message including Admin Status Object with the Delete (D) and
      Reflect (R) bits set.  Alternatively, the egress node sends a
      PathErr message with the Path_State_Removed flag set upstream;

   o  When the ingress node receive the RESV message or the PathErr
      message, it sends a PathTear message to remove the LSP;

   o  The egress node takes a timestamp (T2) once it receives the last
      bit of the PathTear message.  The LSP graceful release delay is
      then (T2-T1).

   o  If the ingress node sends the PATH message downstream, but the
      egress node fails to receive the PathTear message within a
      reasonable period of time, the LSP graceful release delay is
      deemed to be undefined.  Note that the 'reasonable' threshold is a
      parameter of the methodology.

   In the second circumstance, the methodology would proceed as follows:



Sun & Zhang              Expires March 11, 2010                [Page 24]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  Make sure the LSP to be deleted is set up;

   o  On the egress node, form the RESV message including Admin Status
      Object with the Reflect (R) and Delete (D) bits set.  A timestamp
      may be stored locally on the egress node when the RESV message
      packet is sent towards the ingress node;

   o  Upon receiving the Admin Status Object with the Reflect (R) and
      Delete (D) bits set in the RESV message, the ingress node sends a
      PathTear message downstream to remove the LSP;

   o  Egress node takes a timestamp (T2) once it receives the last bit
      of the PathTear message.  The LSP graceful release delay is then
      (T2-T1).

   o  If the egress node sends the RESV message upstream, but it fails
      to receive the PathTear message within a reasonable period of
      time, the LSP graceful release delay is deemed to be undefined.
      Note that the 'reasonable' threshold is a parameter of the
      methodology.































Sun & Zhang              Expires March 11, 2010                [Page 25]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


9.  A Definition for Samples of Single Uni-directional LSP Setup Delay

   In Section 4, we have defined the singleton metric of Single uni-
   directional LSP setup delay.  Now we define how to get one particular
   sample of Single uni-directional LSP setup delay.  Sampling is to
   select a particular potion of singleton values of the given
   parameters.  Like in [RFC2330], we use Poisson sampling as an
   example.

9.1.  Metric Name

   Single uni-directional LSP setup delay sample

9.2.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T0, a time

   o  Tf, a time

   o  Lambda, a rate in the reciprocal milliseconds

   o  Th, LSP holding time

   o  Td, the maximum waiting time for successful setup

9.3.  Metric Units

   A sequence of pairs; the elements of each pair are:

   o  T, a time when setup is attempted

   o  dT, either a real number or an undefined number of milliseconds.

9.4.  Definition

   Given T0, Tf, and lambda, compute a pseudo-random Poisson process
   beginning at or before T0, with average arrival rate lambda, and
   ending at or after Tf.  Those time values greater than or equal to T0
   and less than or equal to Tf are then selected.  At each of the times
   in this process, we obtain the value of uni-directional LSP setup
   delay sample at this time.  The value of the sample is the sequence
   made up of the resulting <time, LSP setup delay> pairs.  If there are
   no such pairs, the sequence is of length zero and the sample is said
   to be empty.



Sun & Zhang              Expires March 11, 2010                [Page 26]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


9.5.  Discussion

   The parameter lambda should be carefully chosen.  If the rate is too
   high, too frequent LSP setup/release procedure will result in high
   overhead in the control plane.  In turn, the high overhead will
   increase uni-directional LSP setup delay.  On the other hand if the
   rate is too low, the sample could not completely reflect the dynamic
   provisioning performance of the GMPLS network.  The appropriate
   lambda value depends on the given network.

   The parameters Td should be carefully chosen.  Different switching
   technologies may vary significantly in performing a cross-connect
   operation.  At the same time, the time needed in setting up an LSP
   under different traffic may also vary significantly.

   In the case of active measurement, the parameters Th should be
   carefully chosen.  The combination of lambda and Th reflects the load
   of the network.  The selection of Th should take into account that
   the network has sufficient resource to perform subsequent tests.  The
   value of Th MAY be constant during one sampling process for
   simplicity considerations.

   Note that for online or passive measurements, the arrival rate and
   LSP holding time are determined by actual traffic, hence in this case
   Lambda and Th are not input parameters.

9.6.  Methodologies

   o  Select the times using the specified Poisson arrival process, and

   o  Set up the LSP as the methodology for the singleton uni-
      directional LSP setup delay, and obtain the value of uni-
      directional LSP setup delay

   o  Release the LSP after Th, and wait for the next Poisson arrival
      event

   Note that: it is possible that before the previous LSP release
   procedure completes, the next Poisson arrival event arrives and the
   LSP setup procedure is initiated.  If there is resource contention
   between the two LSPs, the LSP setup may fail.  Ways to avoid such
   contention are outside the scope of this document.

9.7.  Typical testing cases







Sun & Zhang              Expires March 11, 2010                [Page 27]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


9.7.1.  With no LSP in the Network

9.7.1.1.  Motivation

   Single uni-directional LSP setup delay with no LSP in the network is
   important because this reflects the inherent delay of an RSVP-TE
   implementation.  The minimum value provides an indication of the
   delay that will likely be experienced when an LSP traverses the
   shortest route with the lightest load in the control plane.

9.7.1.2.  Methodologies

   Make sure that there is no LSP in the network, and proceed with the
   methodologies described in Section 9.6.

9.7.2.  With a number of LSPs in the Network

9.7.2.1.  Motivation

   Single uni-directional LSP setup delay with a number of LSPs in the
   network is important because it reflects the performance of an
   operational network with considerable load.  This delay may vary
   significantly as the number of existing LSPs vary.  It can be used as
   a scalability metric of an RSVP-TE implementation.

9.7.2.2.  Methodologies

   Setup the required number of LSPs, and wait until the network reaches
   a stable state, then proceed with the methodologies described in
   Section 9.6.





















Sun & Zhang              Expires March 11, 2010                [Page 28]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


10.  A Definition for Samples of Multiple Uni-directional LSPs Setup
     Delay

   In Section 5, we have defined the singleton metric of multiple uni-
   directional LSPs setup delay.  Now we define how to get one
   particular sample of multiple uni-directional LSP setup delay.
   Sampling is to select a particular potion of singleton values of the
   given parameters.  Like in [RFC2330], we use Poisson sampling as an
   example.

10.1.  Metric Name

   Multiple uni-directional LSPs setup delay sample

10.2.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T0, a time

   o  Tf, a time

   o  Lambda_m, a rate in the reciprocal milliseconds

   o  Lambda, a rate in the reciprocal milliseconds

   o  X, the number of LSPs to setup

   o  Th, LSP holding time

   o  Td, the maximum waiting time for successful multiple uni-
      directional LSPs setup

10.3.  Metric Units

   A sequence of pairs; the elements of each pair are:

   o  T, a time when the first setup is attempted

   o  dT, either a real number or an undefined number of milliseconds.

10.4.  Definition

   Given T0, Tf, and lambda, compute a pseudo-random Poisson process
   beginning at or before T0, with average arrival rate lambda, and
   ending at or after Tf.  Those time values greater than or equal to T0



Sun & Zhang              Expires March 11, 2010                [Page 29]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   and less than or equal to Tf are then selected.  At each of the time
   in this process, we obtain the value of multiple uni-directional LSP
   setup delay sample at this time.  The value of the sample is the
   sequence made up of the resulting <time, setup delay> pairs.  If
   there are no such pairs, the sequence is of length zero and the
   sample is said to be empty.

10.5.  Discussion

   The parameter lambda is used as arrival rate of "bacth uni-
   directional LSPs setup" operation.  It regulates the interval in
   between each batch operation.  The parameter lambda_m is used within
   each batch operation, as described in Section 5.

   The parameters lambda and lambda_m should be carefully chosen.  If
   the rate is too high, too frequent LSP setup/release procedure will
   result in high overhead in the control plane.  In turn, the high
   overhead will increase uni-directional LSP setup delay.  On the other
   hand if the rate is too low, the sample could not completely reflect
   the dynamic provisioning performance of the GMPLS network.  The
   appropriate lambda and lambda_m value depends on the given network.

   The parameters Td should be carefully chosen.  Different switching
   technologies may vary significantly in performing a cross-connect
   operation.  At the same time, the time needed in setting up an LSP
   under different traffic may also vary significantly.

10.6.  Methodologies

   o  Select the times using the specified Poisson arrival process, and

   o  Set up the LSP as the methodology for the singleton multiple uni-
      directional LSPs setup delay, and obtain the value of multiple
      uni-directional LSPs setup delay

   o  Release the LSP after Th, and wait for the next Poisson arrival
      event

   Note that: it is possible that before the previous LSP release
   procedure completes, the next Poisson arrival event arrives and the
   LSP setup procedure is initiated.  If there is resource contention
   between the two LSPs, the LSP setup may fail.  Ways to avoid such
   contention are outside the scope of this document.

10.7.  Typical testing cases






Sun & Zhang              Expires March 11, 2010                [Page 30]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


10.7.1.  With No LSP in the Network

10.7.1.1.  Motivation

   Multiple uni-directional LSP setup delay with no LSP in the network
   is important because this reflects the inherent delay of an RSVP-TE
   implementation.  The minimum value provides an indication of the
   delay that will likely be experienced when LSPs traverse the shortest
   route with the lightest load in the control plane.

10.7.1.2.  Methodologies

   Make sure that there is no LSP in the network, and proceed with the
   methodologies described in Section 10.6.

10.7.2.  With a Number of LSPs in the Network

10.7.2.1.  Motivation

   Multiple uni-directional LSPs setup delay with a number of LSPs in
   the network is important because it reflects the performance of an
   operational network with considerable load.  This delay can vary
   significantly as the number of existing LSPs vary.  It can be used as
   a scalability metric of an RSVP-TE implementation.

10.7.2.2.  Methodologies

   Setup the required number of LSPs, and wait until the network reaches
   a stable state, then proceed with the methodologies described in
   Section 10.6..





















Sun & Zhang              Expires March 11, 2010                [Page 31]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


11.  A Definition for Samples of Single Bi-directional  LSP Setup Delay

   In Section 6, we have defined the singleton metric of Single Bi-
   directional LSP setup delay.  Now we define how to get one particular
   sample of Single Bi-directional LSP setup delay.  Sampling is to
   select a particular potion of singleton values of the given
   parameters.  Like in [RFC2330], we use Poisson sampling as an
   example.

11.1.  Metric Name

   Single Bi-directional LSP setup delay sample with no LSP in the
   network

11.2.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T0, a time

   o  Tf, a time

   o  Lambda, a rate in the reciprocal milliseconds

   o  Th, LSP holding time

   o  Td, the maximum waiting time for successful setup

11.3.  Metric Units

   A sequence of pairs; the elements of each pair are:

   o  T, a time when setup is attempted

   o  dT, either a real number or an undefined number of milliseconds.

11.4.  Definition

   Given T0, Tf, and lambda, compute a pseudo-random Poisson process
   beginning at or before T0, with average arrival rate lambda, and
   ending at or after Tf.  Those time values greater than or equal to T0
   and less than or equal to Tf are then selected.  At each of the times
   in this process, we obtain the value of Bi-directional LSP setup
   delay sample at this time.  The value of the sample is the sequence
   made up of the resulting <time, LSP setup delay> pairs.  If there are
   no such pairs, the sequence is of length zero and the sample is said



Sun & Zhang              Expires March 11, 2010                [Page 32]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   to be empty.

11.5.  Discussion

   The parameters lambda should be carefully chosen.  If the rate is too
   high, too frequent LSP setup/release procedure will result in high
   overhead in the control plane.  In turn, the high overhead will
   increase Bi-directional LSP setup delay.  On the other hand if the
   rate is too low, the sample could not completely reflect the dynamic
   provisioning performance of the GMPLS network.  The appropriate
   lambda value depends on the given network.

   The parameters Td should be carefully chosen.  Different switching
   technologies may vary significantly in performing a cross-connect
   operation.  At the same time, the time needed in setting up an LSP
   under different traffic may also vary significantly.

   In the case of active measurement, the parameters Th should be
   carefully chosen.  The combination of lambda and Th reflects the load
   of the network.  The selection of Th SHOULD take into account that
   the network has sufficient resource to perform subsequent tests.  The
   value of Th MAY be constant during one sampling process for
   simplicity considerations.

   Note that for online or passive measurements, the arrival rate and
   the LSP holding time are determined by actual traffic, hence in this
   case Lambda and Th are not input parameters.

11.6.  Methodologies

   o  Select the times using the specified Poisson arrival process, and

   o  Set up the LSP as the methodology for the singleton bi-directional
      LSP setup delay, and obtain the value of bi-directional LSP setup
      delay

   o  Release the LSP after Th, and wait for the next Poisson arrival
      event

   Note that: it is possible that before the previous LSP release
   procedure completes, the next Poisson arrival event arrives and the
   LSP setup procedure is initiated.  If there is resource contention
   between the two LSPs, the LSP setup may fail.  Ways to avoid such
   contention are outside the scope of this document.







Sun & Zhang              Expires March 11, 2010                [Page 33]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


11.7.  Typical testing cases

11.7.1.  With No LSP in the Network

11.7.1.1.  Motivation

   Single bi-directional LSP setup delay with no LSP in the network is
   important because this reflects the inherent delay of an RSVP-TE
   implementation.  The minimum value provides an indication of the
   delay that will likely be experienced when an LSP traverses the
   shortest route with the lightest load in the control plane.

11.7.1.2.  Methodologies

   Make sure that there is no LSP in the network, and proceed with the
   methodologies described in Section 11.6.

11.7.2.  With a Number of LSPs in the Network

11.7.2.1.  Motivation

   Single bi-directional LSP setup delay with a number of LSPs in the
   network is important because it reflects the performance of an
   operational network with considerable load.  This delay can vary
   significantly as the number of existing LSPs varies.  It can be used
   as a scalability metric of an RSVP-TE implementation.

11.7.2.2.  Methodologies

   Setup the required number of LSPs, and wait until the network reaches
   a stable state, then proceed with the methodologies described in
   Section 11.6. .



















Sun & Zhang              Expires March 11, 2010                [Page 34]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


12.  A Definition for Samples of Multiple Bi-directional  LSPs Setup
     Delay

   In Section 7, we have defined the singleton metric of multiple bi-
   directional LSPs setup delay.  Now we define how to get one
   particular sample of multiple bi-directional LSP setup delay.
   Sampling is to select a particular potion of singleton values of the
   given parameters.  Like in [RFC2330], we use Poisson sampling as an
   example.

12.1.  Metric Name

   Multiple bi-directional LSPs setup delay sample

12.2.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T0, a time

   o  Tf, a time

   o  Lambda_m, a rate in the reciprocal milliseconds

   o  Lambda, a rate in the reciprocal milliseconds

   o  X, the number of LSPs to setup

   o  Th, LSP holding time

   o  Td, the maximum waiting time for successful multiple uni-
      directional LSPs setup

12.3.  Metric Units

   A sequence of pairs; the elements of each pair are:

   o  T, a time when the first setup is attempted

   o  dT, either a real number or an undefined number of milliseconds.

12.4.  Definition

   Given T0, Tf, and lambda, compute a pseudo-random Poisson process
   beginning at or before T0, with average arrival rate lambda, and
   ending at or after Tf.  Those time values greater than or equal to T0



Sun & Zhang              Expires March 11, 2010                [Page 35]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   and less than or equal to Tf are then selected.  At each of the times
   in this process, we obtain the value of multiple uni-directional LSP
   setup delay sample at this time.  The value of the sample is the
   sequence made up of the resulting <time, setup delay> pairs.  If
   there are no such pairs, the sequence is of length zero and the
   sample is said to be empty.

12.5.  Discussion

   The parameter lambda is used as arrival rate of "bacth bi-directional
   LSPs setup" operation.  It regulates the interval in between each
   batch operation.  The parameter lambda_m is used within each batch
   operation, as described in Section 7.

   The parameters lambda and lambda_m should be carefully chosen.  If
   the rate is too high, too frequent LSP setup/release procedure will
   result in high overhead in the control plane.  In turn, the high
   overhead will increase uni-directional LSP setup delay.  On the other
   hand if the rate is too low, the sample could not completely reflect
   the dynamic provisioning performance of the GMPLS network.  The
   appropriate lambda and lambda_m value depends on the given network.

   The parameters Td should be carefully chosen.  Different switching
   technologies may vary significantly in performing a cross-connect
   operation.  At the same time, the time needed in setting up an LSP
   under different traffic may also vary significantly.

12.6.  Methodologies

   o  Select the times using the specified Poisson arrival process, and

   o  Set up the LSP as the methodology for the singleton multiple bi-
      directional LSPs setup delay, and obtain the value of multiple
      uni-directional LSPs setup delay

   o  Release the LSP after Th, and wait for the next Poisson arrival
      event

   Note that: it is possible that before the previous LSP release
   procedure completes, the next Poisson arrival event arrives and the
   LSP setup procedure is initiated.  If there is resource contention
   between the two LSPs, the LSP setup may fail.  Ways to avoid such
   contention are outside the scope of this document.

12.7.  Typical testing cases






Sun & Zhang              Expires March 11, 2010                [Page 36]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


12.7.1.  With No LSP in the Network

12.7.1.1.  Motivation

   Multiple bi-directional LSPs setup delay with no LSP in the network
   is important because this reflects the inherent delay of an RSVP-TE
   implementation.  The minimum value provides an indication of the
   delay that will likely be experienced when an LSPs traverse the
   shortest route with the lightest load in the control plane.

12.7.1.2.  Methodologies

   Make sure that there is no LSP in the network, and proceed with the
   methodologies described in Section 10.6.

12.7.2.  With a Number of LSPs in the Network

12.7.2.1.  Motivation

   multiple bi-directional LSPs setup delay with a number of LSPs in the
   network is important because it reflects the performance of an
   operational network with considerable load.  This delay may vary
   significantly as the number of existing LSPs vary.  It may be used as
   a scalability metric of an RSVP-TE implementation.

12.7.2.2.  Methodologies

   Setup the required number of LSPs, and wait until the network reaches
   a stable state, then proceed with the methodologies described in
   Section 12.6..





















Sun & Zhang              Expires March 11, 2010                [Page 37]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


13.  A Definition for Samples of LSP Graceful Release Delay

   In Section 8, we have defined the singleton metric of LSP graceful
   release delay.  Now we define how to get one particular sample of LSP
   graceful release delay.  We also use Poisson sampling as an example.

13.1.  Metric Name

   LSP graceful release delay sample

13.2.  Metric Parameters

   o  ID0, the ingress LSR ID

   o  ID1, the egress LSR ID

   o  T0, a time

   o  Tf, a time

   o  Lambda, a rate in reciprocal milliseconds

   o  Td, the maximum waiting time for successful LSP release

13.3.  Metric Units

   A sequence of pairs; the elements of each pair are:

   o  T, a time, and

   o  dT, either a real number or an undefined number of milliseconds.

13.4.  Definition

   Given T0, Tf, and lambda, we compute a pseudo-random Poisson process
   beginning at or before T0, with average arrival rate lambda, and
   ending at or after Tf.  Those time values greater than or equal to T0
   and less than or equal to Tf are then selected.  At each of the times
   in this process, we obtain the value of LSP graceful release delay
   sample at this time.  The value of the sample is the sequence made up
   of the resulting <time, LSP graceful delay> pairs.  If there are no
   such pairs, the sequence is of length zero and the sample is said to
   be empty.

13.5.  Discussion

   The parameter lambda should be carefully chosen.  If the rate is too
   large, too frequent LSP setup/release procedure will result in high



Sun & Zhang              Expires March 11, 2010                [Page 38]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   overhead in the control plane.  In turn, the high overhead will
   increase uni-directional LSP setup delay.  On the other hand if the
   rate is too small, the sample could not completely reflect the
   dynamic provisioning performance of the GMPLS network.  The
   appropriate lambda value depends on the given network.

13.6.  Methodologies

   Generally the methodology would proceed as follows:

   o  Setup the LSP to be deleted

   o  Select the times using the specified Poisson arrival process, and

   o  Release the LSP as the methodology for the singleton LSP graceful
      release delay, and obtain the value of LSP graceful release delay

   o  Setup the LSP, and restart the Poisson arrival process, wait for
      the next Poisson arrival event
































Sun & Zhang              Expires March 11, 2010                [Page 39]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


14.  Some Statistics Definitions for Metrics to Report

   Given the samples of the performance metric, we now offer several
   statistics of these samples to report.  From these statistics, we can
   draw some useful conclusions of a GMPLS network.  The value of these
   metrics is either a real number, or an undefined number of
   milliseconds.  In the following discussion, we only consider the
   finite values.

14.1.  The Minimum of Metric

   The minimum of metric is the minimum of all the dT values in the
   sample.  In computing this, undefined values SHOULD be treated as
   infinitely large.  Note that this means that the minimum could thus
   be undefined if all the dT values are undefined.  In addition, the
   metric minimum SHOULD be set to undefined if the sample is empty.

14.2.  The Median of Metric

   Metric median is the median of the dT values in the given sample.  In
   computing the median, the undefined values MUST NOT be counted in.

14.3.  The percentile of Metric

   The "empirical distribution function" (EDF) of a set of scalar
   measurements is a function F(x) which for any x gives the fractional
   proportion of the total measurements that were <= x.

   Given a percentage X, the X-th percentile of Metric means the
   smallest value of x for which F(x) >= X. Undefined values
   MUST NOT be counted in.

   See RFC2330 for further details.

14.4.  Failure statistics of Metric

   In the process of LSP setup/release, it may fail due to various
   reasons.  For example, setup/release may fail when the control plane
   is overburdened or when there is resource shortage in one of the
   intermediate nodes.  Since the setup/release failure may have
   significant impact on network operation, it is worthwhile to report
   each failure cases, so that appropriate operations can be performed
   to check the possible implementation,configuration or other
   deficiencies.

   Five types of failure events are defined in previous sections:





Sun & Zhang              Expires March 11, 2010                [Page 40]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


   o  Single Uni-directional LSP Setup Failure

   o  Multiple Uni-directional LSP Setup Failure

   o  Single Bi-directional LSP Setup Failure

   o  Multiple Bi-directional LSP Setup Failure

   o  LSP graceful release failure

   Given the samples of the performance metric, we now offer two
   statistics of failure events of these samples to report.

14.4.1.  Failure Count

   Failure Count is defined as the number of the undefined value of the
   corresponding performance metric (failure events) in a sample.  The
   unit of Failure Count is numerical.

14.4.2.  Failure Ratio

   Failure Ratio is the percentage of the number of failure events to
   the total number of requests in a sample.  The calculation for
   Failure Ratio is defined as follows:

   X type failure ratio = Number of X type failure events/(Number of
   valid X type metric values + Number of X type failure events) * 100%.
























Sun & Zhang              Expires March 11, 2010                [Page 41]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


15.  Discussion

   It is worthwhile to point out that:

   o  The uni-directional/bi-directional LSP setup delay is one ingress-
      egress round trip time plus processing time.  But in this
      document, uni-directional/bi-directional LSP setup delay has not
      taken the processing time in the end nodes (ingress or/and egress)
      into account.  The timestamp T2 is taken after the endpoint node
      receives it.  Actually, the last node has to take some time to
      process local procedure.  Similarly, in the LSP graceful release
      delay, the memo has not considered the processing time in the end
      node.

   o  This document assumes that the correct procedures for installing
      the data plane are followed as described in [RFC3209], [RFC3471],
      and [RFC3473].  That is, by the time the egress receives and
      processes a Path message, it is safe for the egress to transmit
      data on the reverse path, and by the time the ingress receives and
      processes a RESV message it is safe for the ingress to transmit
      data on the forward path.  See
      [I-D.shiomoto-ccamp-switch-programming] for detailed explanations.
      This document does not include any verification that the
      implementations of the control plane software are conformant,
      although such tests MAY be constructed with the use of suitable
      signal generation test equipment.  In [I-D.sun-ccamp-dpm], we
      defined a series of metrics to do such verifications.  However, it
      is RECOMMENDED that both the measurements defined in this document
      and the measurements defined in [I-D.sun-ccamp-dpm] are performed
      to complement each other.

   o  Note that, in implementing the tests described in this document a
      tester should be sure to measure the time taken for the control
      plane messages including the processing of those messages by the
      nodes under test.

   o  Bi-directional LSPs may be setup using three way signalling, where
      the initiating node will send a RESV_CONF message downstream upon
      receiving the RESV message.  The RESV_CONF message is used to
      notify the terminate node that it can transfer data upstream.
      Actually, both direction should be ready to transfer data when the
      RESV message is received by the initiate node.  Therefore, the bi-
      directional LSP setup delay defined in this document does not take
      the confirmation procedure into account.







Sun & Zhang              Expires March 11, 2010                [Page 42]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


16.  Security Considerations

   Samples of the metrics can be obtained in either active or passive
   manners.

   In active measurement, ingress nodes inject probing messages into the
   control plane.  The measurement parameters must be carefully selected
   so that the measurements inject trivial amounts of additional traffic
   into the networks they measure.  If they inject "too much" traffic,
   they can skew the results of the measurement, and in extreme cases
   cause congestion and denial of service.

   When samples of the metrics are collected in a passive manner, e.g.,
   by monitoring the operations on real-life LSPs, the implementation of
   the monitoring and reporting mechanism must be careful so that they
   will not be used to attack the control plane.

   Besides, the security considerations pertaining to the original RSVP
   protocol [RFC2205] and its TE extensions [RFC3209] also remain
   relevant.































Sun & Zhang              Expires March 11, 2010                [Page 43]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


17.  IANA Considerations

   This document makes no requests for IANA action.
















































Sun & Zhang              Expires March 11, 2010                [Page 44]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


18.  Acknowledgements

   We wish to thank Dan Li, Fang Liu (Christine), Zafar Ali, Monique
   Morrow, Adrian Farrel, Deborah Brungard, Lou Berger, Thomas D. Nadeau
   for their comments and helps.

   We wish to thank experts from IPPM and BMWG - Reinhard Schrage, Al
   Morton and Henk Uijterwaal, for reviewing this document.

   This document contains ideas as well as text that have appeared in
   existing IETF documents.  The authors wish to thank G. Almes, S.
   Kalidindi and M. Zekauskas.

   We also wish to thank Weisheng Hu, Yaohui Jin and Wei Guo in the
   state key laboratory of advanced optical communication systems and
   networks for the valuable comments.  We also wish to thank the
   support from NSFC and 863 program of China.


































Sun & Zhang              Expires March 11, 2010                [Page 45]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


19.  References

19.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2205]  Braden, B., Zhang, L., Berson, S., Herzog, S., and S.
              Jamin, "Resource ReSerVation Protocol (RSVP) -- Version 1
              Functional Specification", RFC 2205, September 1997.

   [RFC2679]  Almes, G., Kalidindi, S., and M. Zekauskas, "A One-way
              Delay Metric for IPPM", RFC 2679, September 1999.

   [RFC2681]  Almes, G., Kalidindi, S., and M. Zekauskas, "A Round-trip
              Delay Metric for IPPM", RFC 2681, September 1999.

   [RFC3209]  Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V.,
              and G. Swallow, "RSVP-TE: Extensions to RSVP for LSP
              Tunnels", RFC 3209, December 2001.

   [RFC3471]  Berger, L., "Generalized Multi-Protocol Label Switching
              (GMPLS) Signaling Functional Description", RFC 3471,
              January 2003.

   [RFC3473]  Berger, L., "Generalized Multi-Protocol Label Switching
              (GMPLS) Signaling Resource ReserVation Protocol-Traffic
              Engineering (RSVP-TE) Extensions", RFC 3473, January 2003.

   [RFC3945]  Mannie, E., "Generalized Multi-Protocol Label Switching
              (GMPLS) Architecture", RFC 3945, October 2004.

   [RFC4208]  Swallow, G., Drake, J., Ishimatsu, H., and Y. Rekhter,
              "Generalized Multiprotocol Label Switching (GMPLS) User-
              Network Interface (UNI): Resource ReserVation Protocol-
              Traffic Engineering (RSVP-TE) Support for the Overlay
              Model", RFC 4208, October 2005.

19.2.  Informative References

   [I-D.shiomoto-ccamp-switch-programming]
              Shiomoto, K. and A. Farrel, "Advice on When It is Safe to
              Start Sending Data on Label Switched Paths  Established
              Using RSVP-TE", draft-shiomoto-ccamp-switch-programming-00
              (work in progress), February 2009.

   [I-D.sun-ccamp-dpm]
              Sun, W., Zhang, G., Gao, J., Xie, G., Papneja, R., Gu, B.,



Sun & Zhang              Expires March 11, 2010                [Page 46]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks     September 2009


              Wei, X., Otani, T., and R. Jing, "Label Switched Path
              (LSP) Data Path Delay Metric in Generalized MPLS/  MPLS-TE
              Networks", draft-sun-ccamp-dpm-00 (work in progress),
              June 2009.

   [RFC2330]  Paxson, V., Almes, G., Mahdavi, J., and M. Mathis,
              "Framework for IP Performance Metrics", RFC 2330,
              May 1998.











































Sun & Zhang              Expires March 11, 2010                [Page 47]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks          July 2009


Authors' Addresses

   Weiqiang Sun
   Shanghai Jiao Tong University
   800 Dongchuan Road
   Shanghai  200240
   CN

   Phone: +86 21 3420 5359
   Email: sunwq@mit.edu


   Guoying Zhang
   China Academy of Telecommunication Research,MIIT,China.
   No.11 YueTan South Street
   Beijing  100045
   CN

   Phone: +86 1068094272
   Email: zhangguoying@mail.ritt.com.cn


   Jianhua Gao
   Huawei Technologies Co., LTD.
   CN

   Phone: +86 755 28973237
   Email: gjhhit@huawei.com


   Guowu Xie
   University of California, Riverside
   900 University Ave.
   Riverside, CA 92521
   USA

   Phone: +1 951 237 8825
   Email: xieg@cs.ucr.edu


   Rajiv Papneja
   Isocore
   12359 Sunrise Valley Drive, STE 100
   Reston, VA  20190
   USA

   Phone: +1 703 860 9273
   Email: rpapneja@isocore.com



Sun & Zhang               Expires January 3, 2010              [Page 48]

Internet-Draft      LSP Dynamic PPM in GMPLS Networks       January 2009


   Bin Gu
   IXIA
   Oriental Kenzo Plaza 8M,48 Dongzhimen Wai Street,Dongcheng District
   Beijing  200240
   CN

   Phone: +86 13611590766
   Email: BGu@ixiacom.com


   Xueqin Wei
   Fiberhome Telecommunicaiton Technology Co.,Ltd.
   Wuhan
   CN

   Phone: +86 13871127882
   Email: xqwei@fiberhome.com.cn


   Tomohiro Otani
   KDDI R&D Laboratories, Inc.
   2-1-15 Ohara Kamifukuoka Saitama
   356-8502
   Japan

   Phone: +81-49-278-7357
   Email: otani@kddilabs.jp


   Ruiquan Jing
   China Telecom Beijing Research Institute
   118 Xizhimenwai Avenue
   Beijing  100035
   CN

   Phone: +86-10-58552000
   Email: jingrq@ctbri.com.cn














Sun & Zhang               Expires January 3, 2010              [Page 49]

